{
  "texts": [
    {
      "title": "CS2_HUD",
      "titleExt": ".md",
      "folder": "designs",
      "date": "2023-04-27T00:00:00.000Z",
      "tags": [
        "ux/ui",
        "game"
      ],
      "content": "[Behance link:](https://www.behance.net/gallery/169250103/Broadcast-HUD-for-Counter-Strike-2)\n<iframe src=\"https://www.behance.net/embed/project/169250103?ilo0=1\" height=\"316\" width=\"404\" allowfullscreen lazyload frameborder=\"0\" allow=\"clipboard-write\" refererPolicy=\"strict-origin-when-cross-origin\"></iframe>\n"
    },
    {
      "title": "logger!",
      "titleExt": ".md",
      "folder": "designs",
      "date": "2023-03-29T00:00:00.000Z",
      "tags": [
        "ux/ui",
        "product_design",
        "mobile"
      ],
      "content": "[Behance link:](https://www.behance.net/gallery/167072457/logger-rating-and-logging-app)\n<iframe src=\"https://www.behance.net/embed/project/167072457?ilo0=1\" height=\"316\" width=\"404\" allowfullscreen lazyload frameborder=\"0\" allow=\"clipboard-write\" refererPolicy=\"strict-origin-when-cross-origin\"></iframe>\n"
    },
    {
      "title": "Час-пик (MosMetro preview)",
      "titleExt": ".md",
      "folder": "ouvres",
      "date": "2024-11-05T17:05:00.000Z",
      "tags": [
        "test",
        "mosmetro",
        "prose"
      ],
      "content": "\nОчередь перед эскалаторами движется медленно, но верно. В такой плотный будний вечер общественное сознание смогло пренебречь негласным правилом, которое администрация метро уже годами пытается тщетно искоренить, занимать только правую сторону эскалатора, и люди занимают обе стороны ступеньки. Однако же, несмотря на эту крайность, начало очереди всё равно находится под второй с конца аркой, которая ведет с платформы от поезда к центру перрона. Находясь в такое время в такой толпе на лбу у каждого второго невольно появляется испарина, поскольку плотную зимнюю одежду в метро девать некуда, да и холод снаружи не помогает сделать воздух возле эскалаторов менее удушающим. Но не все так плохо у коммьютеров и случайных пассажиров в этот день: работают все три эскалатора, а не как обычно, когда один из них закрыт по неведомым причинам.\n\nВедомый толпой и долей хитрости (ведь со стороны может показаться что люди по наитию скорее толпятся в правый) Человек А встал на ступеньку серединного эскалатора московского метро и лестница под его ногами медленно поползла наверх. Раньше в подобных эскалаторных тоннелях на стенах висела баннерная реклама. Потом её упразднили и тоннели стали голыми. Однако, видимо смущаясь излишней наготы своего приемного детища, баннеры вернули. Только теперь они содержали исключительно социальную рекламу разного уровня погруженности в реальность. Глядя на некоторые из них, раздражение Человека А, и того находящаяся на переделе, вырастало. Так ещё и сосед по ступеньке разговаривал по телефону так громко, что нарушал личное пространство всех людей в радиусе пятнадцати метров.\n\nЧуть выше середины эскалаторного тоннеля Человек А хватает своего соседа двумя руками за грудь и с невероятной силой бросает назад. Первые четыре человека в купе с брошенным болтуном превращаются в живой ком, который пускает цепную реакцию и люди с криками начинают складываться вниз как домино, все 112 человек, кто не успел выпрыгнуть на перегородку. Поднялась паника. Человек А тут же делает ногой выпад вниз, на расчищенные мгновение назад ступени, выкидывая туда же на уровне бедра правую руку с продолговатым предметом. Этот предмет с матовой металлической окраской чем-то напоминает лазерный меч из х/ф «Звездные Войны», за исключением наконечника в виде острого шипа. При выпаде этот шип со стремительной скоростью выстреливает, вытягивая при этом за собой красную, будто светящуюся от жара, нить. Тело А совершает виртуозный оборот вокруг своей оси, раскручивая образующаяся до радиуса ширины тоннеля лассо. Красная нить с невероятной легкостью прорезает попадающиеся на пути рюкзаки с их содержимым, пуховики, пальто, кофты, ремни, штаны, плоть и кости пассажиров метро. Никто, из прорезаемых насквозь, в первые секунды ничего не почувствовал, а замешательство и страх от происходящего продлил блаженное неведение на ещё доли секунд, пока спинной мозг, и каждая вена и артерия, всё ещё пытающиеся гнать кровь в заданной природой направлении; каждый нерв, соединяющий верх и низ тела не поняли, что они больше не соединены и не являются единым целым. Тела людей начали распадаться надвое. На баннерах с социальной рекламой появились кляксы крови. Крик паники перешел в истерический. У некоторых падала сначала верхняя часть туловища, оставляя ноги стоять еще мгновение, показывая окружающим свои внутренности. У других, этих окружающих, правда, времени заметить идеально разрезанные бедренные кости не было, ведь у них первым делом складывались ноги, а потом только верхняя часть с руками, всё ещё сжимавшими смартфоны, и еще видящими глазами. Они падали и так и сяк, падали друг на друга, подчиняясь кукольным законам физики. К ногам тех, кто ещё остался снизу в жалком остатке очереди начала стекать кровь. А эскалаторы не останавливались и продолжали везти мясо."
    }
  ]
}