{
  "texts": [
    {
      "title": "CS2_HUD",
      "titleExt": ".md",
      "folder": "designs",
      "date": "2023-04-27T00:00:00.000Z",
      "tags": [
        "ux/ui",
        "game"
      ],
      "content": "[Behance link:](https://www.behance.net/gallery/169250103/Broadcast-HUD-for-Counter-Strike-2)\n<iframe src=\"https://www.behance.net/embed/project/169250103?ilo0=1\" height=\"316\" width=\"404\" allowfullscreen lazyload frameborder=\"0\" allow=\"clipboard-write\" refererPolicy=\"strict-origin-when-cross-origin\"></iframe>\n"
    },
    {
      "title": "Note on GNX by Kendrick Lamar",
      "titleExt": ".md",
      "folder": "ouvres",
      "date": "2024-12-02T19:09:00.000Z",
      "tags": [
        "notes",
        "music",
        "ru"
      ],
      "content": "**GNX**[^1] — это и есть Кендрик Ламар. \n\nАрка интенсивной терапии[^2] на предыдущей работе **Mr. Morale & The Big Steppers** окончилась победой над давно преследующим его синдромом спасателя[^3] и прокладыванием нового пути праведника. Однако 2024 таил в себе непредвиденное испытание для новоиспеченной благочестивости. Уже ставшим легендарным биф с Дрейком, хоть и завершился безоговорочной победой западного побережья[^4], но образованное торнадо, в центре которого оказался Кендрик, принесло не только новую волну популярности и обожания, но и дебри ненависти и непонимания. Непонимание ранило глубже всего, ведь Кендрик боролся не сколько с конкретной личностью Обри Грэма, а с образом который тот олицетворяет: бездушной поп-махиной, апроприирующей другие культуры исключительно ради наживы, пропагандирующей мизогинию, расточительство и бездумный конформизм. Отсюда и родился ополчившийся на музыкальную индустрию сингл Watch the Party Die, а затем и сам ***GNX***[^5].\n\nЖан-Поль Сартр считал, что каждый должен основывать все свои действия и поступки на собственном образе идеального человека[^6]. Так мы культивируем то человечество, в котором хочется жить. Вот и на **GNX** Кендрик рисует портрет идеального человека, как инструкцию по поведению для всех нас. Он рисует автопортрет. На нём намалёваны два различных образа приводящих к одной сути — к пути праведника, по которому уже следует Кендрик Ламар. И на котором он нас уже заждался. В этом ключе Кендрик является идеальным артистом для назначенной цели: его не только слушают, но и слышат. Его накопленные с годами авторитет, искренность и артистичность зачастую говорят сами за себя и подстёгивают осмыслять искусство, нежели просто поглощать. Но благодаря прошедшему бифу пришло осознание, что аудитория всё-таки бывает медленной, и поэтому, в этот раз, вся концептуальная скорлупа двусмысленности была сброшена в пользу прямоты высказывания[^7]. Кендрик рисует оба образа как есть: вот Я, смотрите как надо; а вот Они, смотрите как не надо.\n\nДля достижения такой непростой цели Кендрик впервые признает, что готов принять на себя вечно оспариваемый в хип-хоп сообществе титул Greatest of All Time[^8]. Отдавая дань Тупаку и другим гениям афро-американской музыкальной сцены, Ламар рефлексирует о том, что уже давно смог достичь тех же высот величия и влияния, не погрязнув при этом в сопутствующих пороках и, самое главное, оставшись в живых. Посему он дает клятву Богу: использовать свой голос и свои дары во благо обществу, клянется \"нести понимание\"[^9]. Это противоречит его недавней победе над комплексом спасателя, и Кендрик этого не скрывает. Он понимает, что с большой силой приходит большая ответственность. Но и о прошлых уроках забывать не надо, так что мир теперь спасается более здоровыми методами: через аффирмацию и бэнгеры. Много бэнгеров[^10]. И каждый из них пропитан любовью и уважением к стилю западного побережья, которому Кендрик считает себя обязанным. Но мало просто отдавать дань, надо ещё и помогать. Поэтому **GNX** пестрит приглашенными битмарями и малоизвестными реперами[^11] из Города Ангелов. Чего только стоит развирусившийся крик Кендрика \"*MUSTAAAAAAARD*\" на ***tv off***. Вот так надо показывать, кому ты обязан своим успехом. \n\nИ вот так надо спасать мир. Через любовь, уважение и самого себя.\n\n\n[^1]: GNX на самом деле это модель автомобиля Buick Regal Grand National лимитированной серии Grand National Experimental. Это последний выпущенный Бьюик в серии Grand National, продавался он исключительно в черном цвете и был выпущен в 1987 году. Как раз именно в год рождения Кендрика Ламара. То есть GNX это не только метафорический Кендрик, но и буквально.\n[^2]: Терапия вообще является одной из главных арок хип-хопа последних лет. Ментальное здоровье являлось табу среди афро-американского населения США, а гэнгстерский и гетто образ главных икон жанра никак не помогал дестигматизации. За последний десяток лет эта тема набирает значительные обороты, не без влияния Канье Уэста и трагичных событий вроде ухода из жизни Juice WRLD и Mac Miller. А **Mr. Morale & The Big Steppers** является ключевым альбомом в этом движении, без которого не существовало бы, к примеру, **Chromakopia** от Tyler, the Creator.\n[^3]: Лицо синдрома спасателя мелькало ещё на **Good kid, m.A.A.d city**, но обличило себя со всей явностью только на опусе **To Pimp A Butterfly**, а затем переросло в озлобленный **DAMN.**. И хоть озлобленность принесла Кендрику Пулитцеровскую премию, дело приняло максимально нездоровый оборот (а я вообще считаю, что премию таким образом выдали постфактум за **TPAB**). Ключевыми композициями в **Mr. Morale & The Big Steppers**, раскрывающими тему синдрома спасателя Ламара, являются ***Savior*** и ***Mirror***.\n[^4]: 1-2-punch из разрушительного ***meet the grahams*** (который вышел через 15 минут после релиза ***Family Matters*** от Дрейка!) и круга почета в виде ***Not Like Us*** не оставил ни капли сомнения о победителе данного противостояния. ***Not Like Us*** побил множество рекордов индустрии, включая наибольшее количество последовательных недель на первом месте в чарте Billboard Hot 100.\n[^5]: **GNX** невозможно воспринимать вне контекста упомянутых событий. На протяжении всего альбома Кендрик то и дело ссылается на различные последствия противостояния, а общая энергия и посыл ощущаются как логическое продолжение основных мотивов, заложенных в диссах. \"*It used to be fuck that nigga, but now it's plural* / *Fuck everybody, that's on my body*\" читается на открывающем ***wacced out murals***.\n[^6]: см. \"Экзистенциализм — это гуманизм\".\n[^7]: Сравните \"*The audience not dumb* / *Shape the stories how you want, hey, Drake, they're not slow*\" из второго куплета ***Not Like Us*** и \"*This is not for lyricists, I swear it's not the sentiments* / *Fuck a double entendre, I want y'all to feel this shit*\" с ***wacced out murals***.\n[^8]: ***man at the garden*** — аффирмация Кендрика Ламара, которая, несмотря на присущую всем реперам нарциссичность, получается настолько уверенной и искренней, что, даже не вбирая в себя весь контекст его творчества, на эмоциональной кульминации композиции признаешь: да, ты действительно всего этого заслуживаешь. Название в свою очередь отсылает к библейской истории, в которой человек перечисляет все вещи которые он сделал в своей жизни, чтобы доказать, что он заслуживает место в райском саду. Другая, более стоическая и экзистенциальная интерпретация названия, в противоположность тексту смиряет Кендрика, утверждает, что, несмотря на все заслуги, он всего лишь садовник в саду [хип-хопа]. Хоть возможно и единственный.\n[^9]: Центральной композицией альбома является ***reincarnated***, в которой используется сэмпл и флоу ***Made Niggaz*** Тупака Шакура. На этом основании рассказывается история о перерождении великого чернокожего артиста: сначала в облике Джон Ли Хукера, затем Билли Холидеи, а затем и самого Кендрика Ламара (из-за очевидного оммажа в цикле перерождения также подразумевается сам Тупак). В своём же куплете Кендрик рефлексирует и ведёт искренний диалог о своих целях, проблемах и противоречиях с самим Богом. ***reincarnated*** войдет в историю как одна из величайших хип-хоп композиций и как лучший концептуальный сторителлинг в дискографии Кендрика со времен **To Pimp A Butterfly** (и не то чтобы при этом в **DAMN.** и **Mr. Morale & The Big Steppers** их было недостаточно).\n[^10]: Дружелюбных к радио и вечеринкам композиций на **GNX** по ощущениям больше чем было за все время с **Good kid, m.A.A.d city**. Причем их невозможно унизить, ссылаясь на упрощение для масс: каждая из них источает высочайший уровень харизмы и артистичности. \n[^11]: Здесь и кроется одна из моих главных претензий к **GNX**. Практически никто из приглашенных на вокал (за исключением SZA) не достигает уровня Кендрика. Каждый раз когда после его куплета вступает приглашенный репер, ощущается заметное падение качества наполнения и моего интереса. Такое количество фитов даже концептуально обосновывается на титульном ***gnx***, но оно как-будто немного притянуто за уши. Да и сам трек этот худший на всем альбоме, а всё из-за несуразного бита и самих фитов. He is just too good for them.\n"
    },
    {
      "title": "logger!",
      "titleExt": ".md",
      "folder": "designs",
      "date": "2023-03-29T00:00:00.000Z",
      "tags": [
        "ux/ui",
        "product_design",
        "mobile"
      ],
      "content": "[Behance link:](https://www.behance.net/gallery/167072457/logger-rating-and-logging-app)\n<iframe src=\"https://www.behance.net/embed/project/167072457?ilo0=1\" height=\"316\" width=\"404\" allowfullscreen lazyload frameborder=\"0\" allow=\"clipboard-write\" refererPolicy=\"strict-origin-when-cross-origin\"></iframe>\n"
    }
  ]
}